-- ----------------------------------------------------------------------
-- Test: assign/alter a role to a resource group
-- ----------------------------------------------------------------------

DROP ROLE IF EXISTS rg_test_role;
DROP ROLE

-- positive
CREATE ROLE rg_test_role;
CREATE ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role';
 rolresgroup 
-------------
 6437        
(1 row)
CREATE ROLE rg_test_role_super SUPERUSER;
CREATE ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)
ALTER ROLE rg_test_role_super NOSUPERUSER;
ALTER ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6437        
(1 row)
ALTER ROLE rg_test_role_super SUPERUSER;
ALTER ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)

ALTER ROLE rg_test_role RESOURCE GROUP none;
ALTER ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role';
 rolresgroup 
-------------
 6437        
(1 row)
ALTER ROLE rg_test_role_super RESOURCE GROUP none;
ALTER ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)

ALTER ROLE rg_test_role RESOURCE GROUP default_group;
ALTER ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role';
 rolresgroup 
-------------
 6437        
(1 row)
ALTER ROLE rg_test_role_super RESOURCE GROUP admin_group;
ALTER ROLE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)


-- negative
ALTER ROLE rg_test_role RESOURCE GROUP non_exist_group;
ERROR:  resource group "non_exist_group" does not exist
ALTER ROLE rg_test_role RESOURCE GROUP admin_group;
ERROR:  only superuser can be assigned to admin resgroup

--cannot create or put role in system_group, should error out
CREATE ROLE r_test_system_group RESOURCE GROUP system_group;
ERROR:  assigning to system resgroup is not allowed
CREATE ROLE r_test_system_group;
CREATE ROLE
ALTER ROLE r_test_system_group RESOURCE GROUP system_group;
ERROR:  assigning to system resgroup is not allowed

CREATE ROLE rg_test_role1 RESOURCE GROUP non_exist_group;
ERROR:  resource group "non_exist_group" does not exist
-- nonsuper user should not be assigned to admin group
CREATE ROLE rg_test_role1 RESOURCE GROUP admin_group;
ERROR:  only superuser can be assigned to admin resgroup

-- cleanup
DROP ROLE rg_test_role;
DROP ROLE
DROP ROLE rg_test_role_super;
DROP ROLE
DROP ROLE r_test_system_group;
DROP ROLE

-- ----------------------------------------------------------------------
-- Test: create/drop a resource group
-- ----------------------------------------------------------------------

--start_ignore
DROP RESOURCE GROUP rg_test_group;
ERROR:  resource group "rg_test_group" does not exist
--end_ignore

SELECT * FROM gp_toolkit.gp_resgroup_config;
 groupid | groupname     | concurrency | cpu_max_percent | cpu_weight | cpuset | memory_quota | min_cost | io_limit 
---------+---------------+-------------+-----------------+------------+--------+--------------+----------+----------
 6437    | default_group | 20          | 20              | 100        | -1     | -1           | 500      | -1       
 6438    | admin_group   | 10          | 10              | 100        | -1     | -1           | 500      | -1       
 6441    | system_group  | 0           | 10              | 100        | -1     | -1           | 500      | -1       
(3 rows)

-- negative

-- can't create the reserved resource groups
CREATE RESOURCE GROUP default_group WITH (cpu_max_percent=10);
ERROR:  resource group "default_group" already exists
CREATE RESOURCE GROUP admin_group WITH (cpu_max_percent=10);
ERROR:  resource group "admin_group" already exists
CREATE RESOURCE GROUP none WITH (cpu_max_percent=10);
ERROR:  resource group name "none" is reserved

-- multiple resource groups can't share the same name
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10);
CREATE RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10);
ERROR:  resource group "rg_test_group" already exists
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP

-- can't specify the resource limit type multiple times
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=1, cpu_max_percent=5, concurrency=1);
ERROR:  found duplicate resource group resource type: concurrency
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=5, cpu_max_percent=5);
ERROR:  found duplicate resource group resource type: cpu_max_percent
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0', cpuset='0');
ERROR:  found duplicate resource group resource type: cpuset

-- can't specify both cpu_max_percent and cpuset
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=5, cpuset='0');
ERROR:  can't specify both cpu_max_percent and cpuset

-- cpu_weight can't be negative value
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=5, cpu_weight=-100);
ERROR:  cpu_weight range is [1, 500]

-- can't specify invalid cpuset
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset=',');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='-');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='a');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='12a');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0-,');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='-1');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='3-1');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset=' 0 ');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='4;a');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='-;4');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset=';5');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='5;');
ERROR:  cpuset invalid

---- suppose the core numbered 1024 is not exist
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='1024');
ERROR:  cpu cores 1024 are unavailable on the system
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,');
ERROR:  the length of cpuset reached the upper limit 1024
-- can't alter to invalid cpuset
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0');
CREATE RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group set CPUSET '';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ',';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '-';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET 'a';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '12a';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '0-';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '-1';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '3-1';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ' 0 ';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '4;a';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '-;4';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ';5';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '5;';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ';';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '1;2;';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '1;2;3';
ERROR:  cpuset invalid
---- suppose the core numbered 1024 is not exist
ALTER RESOURCE GROUP rg_test_group set CPUSET '1024';
ERROR:  cpu cores 1024 are unavailable on the system
ALTER RESOURCE GROUP rg_test_group set CPUSET '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,';
ERROR:  the length of cpuset reached the upper limit 1024
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
-- can't drop non-exist resource group
DROP RESOURCE GROUP non_exist_group;
ERROR:  resource group "non_exist_group" does not exist
-- can't drop reserved resource groups
DROP RESOURCE GROUP default_group;
ERROR:  cannot drop default resource group "default_group"
DROP RESOURCE GROUP admin_group;
ERROR:  cannot drop default resource group "admin_group"
DROP RESOURCE GROUP system_group;
ERROR:  cannot drop default resource group "system_group"
DROP RESOURCE GROUP none;
ERROR:  resource group "none" does not exist

-- positive
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10);
CREATE RESOURCE GROUP
SELECT groupname,concurrency,cpu_max_percent, cpu_weight FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_max_percent | cpu_weight 
---------------+-------------+-----------------+------------
 rg_test_group | 20          | 10              | 100        
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=1, cpuset='0');
CREATE RESOURCE GROUP
SELECT groupname,concurrency,cpu_max_percent, cpu_weight FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_max_percent | cpu_weight 
---------------+-------------+-----------------+------------
 rg_test_group | 1           | -1              | 100        
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, cpu_weight=500);
CREATE RESOURCE GROUP
SELECT groupname,concurrency,cpu_max_percent, cpu_weight FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_max_percent | cpu_weight 
---------------+-------------+-----------------+------------
 rg_test_group | 20          | 10              | 500        
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=-1, cpu_weight=500);
CREATE RESOURCE GROUP
SELECT groupname,concurrency,cpu_max_percent, cpu_weight FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_max_percent | cpu_weight 
---------------+-------------+-----------------+------------
 rg_test_group | 20          | -1              | 500        
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0', cpu_weight=500);
CREATE RESOURCE GROUP
SELECT groupname,concurrency,cpu_max_percent, cpu_weight FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_max_percent | cpu_weight 
---------------+-------------+-----------------+------------
 rg_test_group | 20          | -1              | 500        
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0');
CREATE RESOURCE GROUP
SELECT groupname,concurrency,cpu_max_percent,cpu_weight FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_max_percent | cpu_weight 
---------------+-------------+-----------------+------------
 rg_test_group | 20          | -1              | 100        
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0;0-1');
CREATE RESOURCE GROUP
SELECT groupname,concurrency,cpu_max_percent,cpu_weight,cpuset FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_max_percent | cpu_weight | cpuset 
---------------+-------------+-----------------+------------+--------
 rg_test_group | 20          | -1              | 100        | 0;0-1  
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
-- ----------------------------------------------------------------------
-- Test: boundary check in create resource group syntax
-- ----------------------------------------------------------------------

-- negative: cpu_max_percent should be in [1, 100]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=101);
ERROR:  cpu_max_percent range is [1, 100] or equals to -1
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=0);
ERROR:  cpu_max_percent range is [1, 100] or equals to -1

-- negative: concurrency should be in [1, max_connections]
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=-1, cpu_max_percent=10);
ERROR:  concurrency range is [0, 'max_connections']
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=26, cpu_max_percent=10);
ERROR:  concurrency range is [0, 'max_connections']

-- negative: the cores of cpuset in different groups mustn't overlap
CREATE RESOURCE GROUP rg_test_group1 WITH (cpuset='0');
CREATE RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group2 WITH (cpuset='0');
ERROR:  cpu cores 0 are used by resource group rg_test_group1
DROP RESOURCE GROUP rg_test_group1;
DROP RESOURCE GROUP

-- negative: cpu_weight should be in [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, cpu_weight=0);
ERROR:  cpu_weight range is [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, cpu_weight=-1);
ERROR:  cpu_weight range is [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, cpu_weight=-1024);
ERROR:  cpu_weight range is [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, cpu_weight=501);
ERROR:  cpu_weight range is [1, 500]

-- positive: cpu_max_percent should be in [1, 100]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=60);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=1);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP

-- positive: cpu_weight should be in [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, cpu_weight=100);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, cpu_weight=500);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP

-- positive: concurrency should be in [0, max_connections]
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=0, cpu_max_percent=10);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=1, cpu_max_percent=10);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=25, cpu_max_percent=10);
CREATE RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
CREATE RESOURCE GROUP rg1_test_group WITH (concurrency=1, cpu_max_percent=10);
CREATE RESOURCE GROUP
CREATE RESOURCE GROUP rg2_test_group WITH (concurrency=1, cpu_max_percent=500);
ERROR:  cpu_max_percent range is [1, 100] or equals to -1
DROP RESOURCE GROUP rg1_test_group;
DROP RESOURCE GROUP
DROP RESOURCE GROUP rg2_test_group;
ERROR:  resource group "rg2_test_group" does not exist

-- positive: min_cost should be in [0,INT32_MAX]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, min_cost=0);
CREATE RESOURCE GROUP
CREATE RESOURCE GROUP rg1_test_group WITH (cpu_max_percent=10, min_cost=2147483647);
CREATE RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET min_cost 2147483647;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg1_test_group SET min_cost 0;
ALTER RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
DROP RESOURCE GROUP rg1_test_group;
DROP RESOURCE GROUP

-- negative: min_cost should be in [0,INT32_MAX]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, min_cost=-1);
ERROR:  The min_cost value can't be less than 0.
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, min_cost=2147483648);
ERROR:  capability min_cost is out of range
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, min_cost=0);
CREATE RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET min_cost -1;
ERROR:  The min_cost value can't be less than 0.
ALTER RESOURCE GROUP rg_test_group SET min_cost 2147483648;
ERROR:  syntax error at or near "2147483648"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET min_cost 2147483648;
                                                        ^
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP

--
-- ----------------------------------------------------------------------
-- Test: alter a resource group
-- ----------------------------------------------------------------------
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=5);
CREATE RESOURCE GROUP

-- ALTER RESOURCE GROUP SET CONCURRENCY N
-- negative: concurrency should be in [1, max_connections]
ALTER RESOURCE GROUP admin_group SET CONCURRENCY 0;
ERROR:  admin_group must have at least one concurrency
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY -1;
ERROR:  concurrency range is [0, 'max_connections']
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 26;
ERROR:  concurrency range is [0, 'max_connections']
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY -0.5;
ERROR:  syntax error at or near "0.5"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY -0.5;
                                                            ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 0.5;
ERROR:  syntax error at or near "0.5"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 0.5;
                                                           ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY a;
ERROR:  syntax error at or near "a"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY a;
                                                           ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 'abc';
ERROR:  syntax error at or near "'abc'"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 'abc';
                                                           ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY '1';
ERROR:  syntax error at or near "'1'"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY '1';
                                                           ^
-- positive: concurrency should be in [1, max_connections]
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 0;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 1;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 2;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 25;
ALTER RESOURCE GROUP

-- ALTER RESOURCE GROUP SET cpu_max_percent VALUE
-- negative: cpu_max_percent should be in [1, 100]
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent -0.1;
ERROR:  syntax error at or near "0.1"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent -0.1;
                                                                ^
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent -1;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 0;
ERROR:  cpu_max_percent range is [1, 100] or equals to -1
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 0.7;
ERROR:  syntax error at or near "0.7"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 0.7;
                                                               ^
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 1.7;
ERROR:  syntax error at or near "1.7"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 1.7;
                                                               ^
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 61;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent a;
ERROR:  syntax error at or near "a"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent a;
                                                               ^
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 'abc';
ERROR:  syntax error at or near "'abc'"
LINE 1: ...LTER RESOURCE GROUP rg_test_group SET cpu_max_percent 'abc';
                                                                 ^
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 20%;
ERROR:  syntax error at or near "%"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 20%;
                                                                 ^
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 0.2%;
ERROR:  syntax error at or near "0.2"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 0.2%;
                                                               ^
-- positive: cpu_max_percent should be in [1, 100]
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 1;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 2;
ALTER RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 60;
ALTER RESOURCE GROUP
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP

-- positive: cpuset and cpu_max_percent are exclusive,
-- if cpu_max_percent is set, cpuset is empty
-- if cpuset is set, cpuset is -1
CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10);
CREATE RESOURCE GROUP
ALTER RESOURCE GROUP rg_test_group SET CPUSET '0';
ALTER RESOURCE GROUP
SELECT groupname,cpu_max_percent,cpuset FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | cpu_max_percent | cpuset 
---------------+-----------------+--------
 rg_test_group | -1              | 0      
(1 row)
ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 10;
ALTER RESOURCE GROUP
SELECT groupname,cpu_max_percent,cpuset FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | cpu_max_percent | cpuset 
---------------+-----------------+--------
 rg_test_group | 10              | -1     
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP

CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10, concurrency=5);
CREATE RESOURCE GROUP
CREATE ROLE rg_test_role RESOURCE GROUP rg_test_group;
CREATE ROLE
SET ROLE rg_test_role;
SET
CREATE TABLE rg_test_group_table(a int);
CREATE TABLE
SELECT count(*) FROM rg_test_group_table;
 count 
-------
 0     
(1 row)
SELECT is_session_in_group(pg_backend_pid(), 'rg_test_group');
 is_session_in_group 
---------------------
 t                   
(1 row)
RESET ROLE;
RESET
SELECT count(*) FROM rg_test_group_table;
 count 
-------
 0     
(1 row)
SELECT is_session_in_group(pg_backend_pid(), 'admin_group');
 is_session_in_group 
---------------------
 t                   
(1 row)
DROP TABLE rg_test_group_table;
DROP TABLE
DROP ROLE rg_test_role;
DROP ROLE
DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP

-- test set cpu_max_percent to high value when gp_resource_group_cpu_limit is low
-- start_ignore
!\retcode gpconfig -c gp_resource_group_cpu_limit -v 0.5;
-- start_ignore
-- end_ignore
(exited with code 0)
!\retcode gpstop -ari;
-- start_ignore
-- end_ignore
(exited with code 0)
-- end_ignore
0: CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=10);
CREATE RESOURCE GROUP
0: ALTER RESOURCE GROUP rg_test_group SET cpu_max_percent 100;
ALTER RESOURCE GROUP
0: DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
-- start_ignore
!\retcode gpconfig -c gp_resource_group_cpu_limit -v 0.9;
-- start_ignore
-- end_ignore
(exited with code 0)
!\retcode gpstop -ari;
-- start_ignore
-- end_ignore
(exited with code 0)
-- end_ignore

-- test set gp_resource_group_cpu_limit to low
1: CREATE RESOURCE GROUP rg_test_group WITH (cpu_max_percent=80);
CREATE RESOURCE GROUP
-- start_ignore
-- 0.6 < 0.9 * 0.8
!\retcode gpconfig -c gp_resource_group_cpu_limit -v 0.6;
-- start_ignore
-- end_ignore
(exited with code 0)
-- startup will fail until the bug is fixed.
!\retcode gpstop -ari;
-- start_ignore
-- end_ignore
(exited with code 0)
-- end_ignore
2: DROP RESOURCE GROUP rg_test_group;
DROP RESOURCE GROUP
-- start_ignore
!\retcode gpconfig -c gp_resource_group_cpu_limit -v 0.9;
-- start_ignore
-- end_ignore
(exited with code 0)
!\retcode gpstop -ari;
-- start_ignore
-- end_ignore
(exited with code 0)
-- end_ignore
